local function run(msg, matches)
  if is_chat_msg(msg) then
    local text = [[
✨‌‌الاوامر المتاحه للمجموعات الخارقه🍂

1⃣ اوامر القفل 🔒

▫️ /قفل الاضافه : 🔹
▫️ /قفل الاسم :🔹
▫️ /قفل البوتات :🔹
▫️ /قفل التكرار :🔹
▫️ / قفل الصور :🔹
▫️ / قفل الروابط :🔹
▫️ /قفل الملصقات :🔹
▫️ /قفل الدردشه :🔹

2⃣ اوامر الفتح 🔓

▫️ /فتح الاضافه : 🔹
▫️ /فتح الاسم
▫️ /فتح البوتات :🔹
▫️/فتح التكرار :🔹
▫️ / فتح الصور :🔸
▫️ / فتح الروابط :🔹
▫️ /قفل الملصقات :🔹
▫️ /فتح الدردشه :🔹

3⃣ اوامر الاضافه و الطرد و الحظر✨

▫️ /اضافه <اختيار> : 🔹
▫️ /طرد <اختيار> : 🔸
▫️ /حظر <اختيار> : 🔹
▫️ /الغاءالحظر <اختيار> : 🔹
▫️ /مغادره :🔹


4⃣ الاوامر العامه للمجموعه ⚠️

▫️ /قوانين :🔹
▫️ /ضع قوانين <القوانين المراد وضعها>: 
▫️ /معلومات @المعرف او بالرد
▫️ /الوصف🔹
▫️ /ضع صوره : 🔹
▫️ /ضع اسم <الاسم المراد وضعه>
▫️ /ايدي : 🔹
▫️ /ايدي الكل :🔸
▫️ /اعدادات :🔸
▫️ /الرابط : 🔹
▫️ /تغيرالرابط :🔸
▫️ /الادمنيه : 🔸
▫️ /مساعده :🔹
▫️ /ملف الايديات : 🔸
▫️ /معلوماتي :🔹

5⃣ اوامر الخاصه بمشرف المجموعه ✨

▫️ /رفع ادمن <المعرف او بالرد  > : 🔹
▫️ /ازاله  ادمن <المعرف او بالرد > : 🔹
✨ /حظر <المعرف او الايدي او بالرد> : 🔹
✨ /الغاء الحظر < الايدي او بالرد> : 🔹

✨ /قائمة الحظر :🔹

▫️#ملاحظه :> جميع الاوامر تعمل بالرد ☑️

يمكن استخدام / و ! للاوامر
‌〰〰〰〰〰〰〰〰〰
للاوامر باللغة الانكليزيه➖🌸☺️
يرجى ارسال 〰>   help/

➖🔸➖🔹➖🔸➖🔹➖]]
    return text
  end
  if is_channel_msg(msg) then
    local text = [[‌‌
✨‌‌الاوامر المتاحه للمجموعات الخارقه🍂

1⃣ اوامر القفل 🔒

▫️ /قفل الاضافه : 🔹
▫️ /قفل الاسم :🔹
▫️ /قفل البوتات :🔹
▫️ /قفل التكرار :🔹
▫️ / قفل الصور :🔹
▫️ / قفل الروابط :🔹
▫️ /قفل الملصقات :🔹
▫️ /قفل الدردشه :🔹

2⃣ اوامر الفتح 🔓

▫️ /فتح الاضافه : 🔹
▫️ /فتح الاسم
▫️ /فتح البوتات :🔹
▫️/فتح التكرار :🔹
▫️ / فتح الصور :🔸
▫️ / فتح الروابط :🔹
▫️ /قفل الملصقات :🔹
▫️ /فتح الدردشه :🔹

3⃣ اوامر الاضافه و الطرد و الحظر✨

▫️ /اضافه <اختيار> : 🔹
▫️ /طرد <اختيار> : 🔸
▫️ /حظر <اختيار> : 🔹
▫️ /الغاءالحظر <اختيار> : 🔹
▫️ /مغادره :🔹


4⃣ الاوامر العامه للمجموعه ⚠️

▫️ /قوانين :🔹
▫️ /ضع قوانين <القوانين المراد وضعها>: 
▫️ /معلومات @المعرف او بالرد
▫️ /الوصف🔹
▫️ /ضع صوره : 🔹
▫️ /ضع اسم <الاسم المراد وضعه>
▫️ /ايدي : 🔹
▫️ /ايدي الكل :🔸
▫️ /اعدادات :🔸
▫️ /الرابط : 🔹
▫️ /تغيرالرابط :🔸
▫️ /الادمنيه : 🔸
▫️ /مساعده :🔹
▫️ /ملف الايديات : 🔸
▫️ /معلوماتي :🔹

5⃣ اوامر الخاصه بمشرف المجموعه ✨

▫️ /رفع ادمن <المعرف او بالرد  > : 🔹
▫️ /ازاله  ادمن <المعرف او بالرد > : 🔹
✨ /حظر <المعرف او الايدي او بالرد> : 🔹
✨ /الغاء الحظر < الايدي او بالرد> : 🔹

✨ /قائمة الحظر :🔹

▫️#ملاحظه :> جميع الاوامر تعمل بالرد ☑️

➖🔸➖🔹➖🔸➖🔹➖]]
    return text
  else
    local text = [[aaa]]
    --return text
  end
end

return {
  description = "Help plugin. Get info from other plugins.  ", 
  usage = {
    "!help: Show list of plugins.",
  },
  patterns = {
    "^/(مساعده)$",
  }, 
  run = run,
}
